{
  "_name_or_path": "google/vit-base-patch16-224",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Aakefa Qaiser",
    "1": "Aaminah Qaiser",
    "2": "Abdur Rehman",
    "3": "Anusha Hamza",
    "4": "Ariba Yasmeen",
    "5": "Asher Hussain Rizvi",
    "6": "Bazil Bashir Faridi",
    "7": "Ebad Ali",
    "8": "Farah Hussain",
    "9": "Farhana Qaiser",
    "10": "Haseeb Shabbir",
    "11": "Laiba Azam",
    "12": "Malaika Ali",
    "13": "Marium Rizvi",
    "14": "Muhammad Ali Rizvi",
    "15": "Rameez Khan",
    "16": "Shagufta Aleem",
    "17": "Shaheer Ali Agha",
    "18": "Ushna Hamza",
    "19": "Usman Rizvi"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Aakefa Qaiser": 0,
    "Aaminah Qaiser": 1,
    "Abdur Rehman": 2,
    "Anusha Hamza": 3,
    "Ariba Yasmeen": 4,
    "Asher Hussain Rizvi": 5,
    "Bazil Bashir Faridi": 6,
    "Ebad Ali": 7,
    "Farah Hussain": 8,
    "Farhana Qaiser": 9,
    "Haseeb Shabbir": 10,
    "Laiba Azam": 11,
    "Malaika Ali": 12,
    "Marium Rizvi": 13,
    "Muhammad Ali Rizvi": 14,
    "Rameez Khan": 15,
    "Shagufta Aleem": 16,
    "Shaheer Ali Agha": 17,
    "Ushna Hamza": 18,
    "Usman Rizvi": 19
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.41.2"
}
